pandasは高度なデータ構造を持ち、Pythonでデータの整理や分析を素早く簡単に行うために設計された分析ツールも持っている  
SciPyやNumPyなどの数値計算ツールや、statsmodelsやscikit-learnなどの分析用ライブラリ、Matplotlibなどの可視化ライブラリと連携して使われることが多い  
NumPyのような配列ベースの計算スタイルや配列ベースの関数を採用していて、NumPy同様にforループを使わないデータ処理を好む

pandasは多くのコーディング用法をNumPyから採用しているが、pandasはテーブル形式のデータや不均一なデータを扱うために設計されていて、NumPyは均一な数値データの扱いに適しているという違いがある

# 5.1  pandasのデータ構造

pandasを扱うためには、シリーズ(Series)とデータフレーム(DataFrame)という便利なデータ構造になれる必要がある  
この2つはすべての問題に対する万能な解決策ではないが、ほとんどのアプリケーションにとって信頼できる使いやすい基盤を提供することができる

## 5.1.1  シリーズ(Series)

シリーズは1次元の配列のようなオブジェクトで、連続した値とそれに関連付けられたインデックスというデータラベルの配列が含まれている  
最もシンプルなシリーズは1つのデータで構成される

In [1]:
import pandas as pd

In [2]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

シリーズの文字列表現では、インデックスが左側、データ値が右側に表示される  
上では、インデックスを指定しなかったため、0から始まるデフォルトのインデックスが作られている

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

valuesとindexアトリビュートをそれぞれ呼び出すことで、シリーズの持つデータ配列とインデックスオブジェクトを取得することができる

In [5]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

Series関数を使ってシリーズを生成するときに、indexにインデックス値をリストで指定することでインデックス付きのシリーズを作成できる

In [6]:
obj2["a"]

-5

In [7]:
obj2["d"] = 6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

NumPyの配列と違って、1つの値や複数の値を参照するときにインデックスのラベルを使って指定することができる

In [9]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [10]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [11]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

条件指定のフィルタリング、スカラー値の掛け算、数学的な関数の適用などのNumPyの関数やNumPy風の操作を行うことができ、その場合もインデックスとデータ値との関連は維持される

In [12]:
"b" in obj2

True

In [13]:
"e" in obj2

False

シリーズをインデックスとデータ値がマッピングされた固定長の順序付きディクショナリととらえることができ、ディクショナリを使う多くの文脈ではシリーズを使うことができる

In [14]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [15]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

ディクショナリ形式のデータを使ってシリーズを作成することもできる

In [16]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [17]:
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Series関数に1つのディクショナリだけを渡した場合は、作成されたシリーズのインデックスはソートされたディクショナリのキーの順番になる  
その順番は上書きすることができ、、ディクショナリのキーをシリーズの中で並べたい順のリストにして渡すとその順番になる  
渡したリストの中にディクショナリのインデックスとして存在しない値を渡した場合はNaN(欠損値)となる  
またディクショナリの中に存在したデータでも、リストで指定されなければシリーズからは除外される

In [18]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

pandasのisnull関数とnotnull関数は欠損値を特定するために使われる

In [20]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

シリーズはisnullとnotnullをメソッドとして呼び出すこともできる

In [22]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

シリーズの機能として、算術演算をしたときに別々にインデックス付けされたデータが自動的に整形される、というものがある

In [25]:
obj4.name = "population"

In [26]:
obj4.index.name = "state"

In [27]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

シリーズオブジェクト自身とインデックスはname属性を持ち、name属性にアクセスして代入を行うことで、それぞれ名前を付けることができる

In [28]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [29]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

シリーズのインデックスは代入を行って置き換えることができる

## 5.1.2  データフレーム(DataFrame)

データフレームはテーブル形式のデータ構造を持ち、順序付けられた列を持っている  
各列には、別々の型を持たせることができる(数値型、文字列型、ブール型など)  
データフレームは行と列の両方にインデックスを持っていて、シリーズをバリューとして持つディクショナリのようなものになる  
データフレームの内部データは、リストやディクショナリ、または1次元か2次元以上の形式で保存されている

データフレームを作成する方法はいくつかあり、最も一般的な方法は同じ長さを持つリスト型のバリューを持ったディクショナリか、NumPyの配列を使った方法になる

In [30]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"], 
       "year": [2000, 2001, 2002, 2001, 2002, 2003], 
       "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [31]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

作成されるデータフレームは、シリーズの時と同じように自動的にインデックスが入る

In [32]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

大きなデータフレームの場合は、headメソッドを使うことで最初の5行のみを表示することができる

In [33]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

データフレームを作成するときに、キーワード引数のcolumnsに列の順番を指定したリストを渡して作成するとデータフレームはその順番通りに並ぶ

In [34]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "dept"], index=["one", "two", "three", "four", "five", "six"])
frame2

       year   state  pop dept
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

指定した列のキーが存在しなかった場合は、その列はすべて欠損値として埋められる

In [35]:
frame2["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [36]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

データフレームの列はディクショナリのような参照や、アトリビュートのようにして呼ぶことで、シリーズとして取り出すことができる  
取り出したシリーズはデータフレームの持っていたインデックスと同じインデックスを持ち、name属性も適切に設定されている

In [37]:
frame2.loc["three"]

year     2002
state    Ohio
pop       3.6
dept      NaN
Name: three, dtype: object

行も位置や名前で参照することができる  
名前で行を参照するときは、locアトリビュートを使い行を指定することでできる

In [38]:
frame2["dept"] = 16.5
frame2

       year   state  pop  dept
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

列の値は代入して変更することができる  
上のようにすると列の要素全てに同じ値が入れる

In [39]:
frame2["dept"] = np.arange(6.)
frame2

       year   state  pop  dept
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

列にリストや配列を代入するときは、リストや配列の値の数がデータフレームの行数と一致していなければならない

In [40]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [41]:
frame2["dept"] = val
frame2

       year   state  pop  dept
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

シリーズを列に代入するときは、ラベルはデータフレームのインデックスに従って代入が行われ、データフレームのインデックスに対応するものがない場合は欠損値が挿入される

In [42]:
frame2["eastern"] = frame2.state == "Ohio"
frame2

       year   state  pop  dept  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

存在しない列に代入を行うと、新しい列が作成される

In [43]:
del frame2["eastern"]
frame2.columns

Index(['year', 'state', 'pop', 'dept'], dtype='object')

delキーワードを使って列を指定すると、列を削除することができる

In [44]:
pop = {"Nevada": {2001: 2.4, 2002: 2.9}, 
      "Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [45]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

ネストしたディクショナリを使ってデータフレームを作成すると、pandasは外側のディクショナリのキーを列のインデックスとして解釈し、内側のインデックスのキーを行のインデックスとして解釈する

In [46]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

データフレームはNumPyの時と同じようにTアトリビュートを呼ぶことで転換することができる

In [47]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

内側のディクショナリのキー(列になる部分)は統合した後にソートされ、データフレームのインデックスになる  
しかし、この時に明示的にインデックスを指定した場合、この処理は行われず、指定された順番になる

In [48]:
pdata = {"Ohio": frame3["Ohio"][:-1], 
        "Nevada": frame3["Nevada"][:2]}

In [49]:
pdata

{'Ohio': 2001    1.7
 2002    3.6
 Name: Ohio, dtype: float64,
 'Nevada': 2001    2.4
 2002    2.9
 Name: Nevada, dtype: float64}

In [50]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

シリーズをバリューに持つディクショナリを使う場合も同じようにDataFrame関数に渡すことができる  

データフレームに渡すことが可能な入力値

|型|説明|
|:-|:-|
|2次元ndarray|データの行列。任意で行と列の名前を渡すことが可能|
|配列、リスト、タプルをバリューに持つディクショナリ|各シーケンスがデータフレーム列になる。すべてのシーケンスは同じ要素数である必要がある|
|NumPyの構造化/レコード配列|配列をバリューに持つディクショナリと同様に扱われる|
|シリーズをバリューに持つディクショナリ|各シリーズが列になる。明示的にインデックスが渡されなかったら、各シリーズのインデックスが統合されて行インデックスになる|
|ディクショナリをバリューに持つディクショナリ|バリューになっている各ディクショナリが列になる。シリーズをバリューに持つディクショナリと同様に、ディクショナリのキーは統合されて行インデックスになる|
|ディクショナリ、またはシリーズのリスト|各要素はデータフレームの行になる。ディクショナリのキーや、シリーズのインデックスはデータフレームの列ラベルになる|
|リスト、またはタプルのリスト|2次元ndarrayと同じように扱われる|
|別のデータフレーム|何も指定しなければ、有力に使用したデータフレームのインデックスがそのままインデックスとして使用される|
|NumPyのMaskedArray|マスクされた値がデータフレームでは欠損値になるという点を除いて、2次元ndarrayと同様に扱われる|

In [51]:
frame3.index.name = "year"; frame3.columns.name = "state"
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

データフレームのindexやcolumnsがname属性を持っている場合は、表に出力される

In [52]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

シリーズと同じように、values属性を参照するとデータフレームの中のデータが2次元のndarrayとして戻される

In [53]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

データフレームの列が異なるdtypeを持つ場合は、すべての列に対応したdtypeが使われる

## 5.1.3  インデックスオブジェクト

pandasのインデックスオブジェクトは、軸のラベルやその他のメタデータ(軸のname属性やnames属性など)を保持する役目を持っている

In [54]:
obj = pd.Series(range(3), index=["a", "b", "c"])

In [55]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [56]:
obj.index[1:]

Index(['b', 'c'], dtype='object')

シリーズやデータフレームを初期化するときに配列やシーケンスなどで指定したラベルは、内部的にはインデックスオブジェクトに変換される

In [57]:
obj.index[1] = "d"

TypeError: Index does not support mutable operations

インデックスオブジェクトはイミュータブルで変更することはできない

In [58]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [59]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [60]:
obj2.index is labels

True

変更不可にすることによって、インデックスオブジェクトをデータ構造内で安全に共有することができる

In [61]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [62]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [63]:
"Ohio" in frame3.columns

True

In [64]:
2002 in frame3.index

True

インデックスオブジェクトは配列と似ているだけでなく、固定長のセットとしても機能する

In [65]:
dup_labels = pd.Index(["foo", " foo", "bar", " bar"])
dup_labels

Index(['foo', ' foo', 'bar', ' bar'], dtype='object')

しかし、セットとは異なり重複したラベルを持つことができる  
重複したラベルでデータを検索すると、そのラベルを持つすべてのデータが抽出される

インデックスオブジェクトには集合演算のための多くのメソッドと属性が用意されていて、それらを使うことで集合に含まれるデータに関する一般的な演算を行うことができる　　

インデックスオブジェクトのメソッドと属性  

|メソッド|説明|
|:-|:-|
|append|追加のインデックスオブジェクトを連結し、新しくインデックスオブジェクトを生成する|
|difference|集合の差を計算して、その差をインデックスオブジェクトとして表現する|
|intersection|集合の論理和を計算する|
|union|和集合を計算する|
|isin|各値が集合に含まれているかどうかを示すブール型の配列を計算する|
|delete|指定したi番目の要素を削除した新しいインデックスオブジェクトを作成する|
|drop|指定した値を削除した新しいインデックスオブジェクトを作成する|
|insert|指定したi番目に要素を挿入して新しいインデックスオブジェクトを作成する|
|is_monotonic|各要素が1つ前の要素と等しいか、それよりも大きい場合にTrueが返される|
|is_unique|インデックスオブジェクトが重複した値を持たない場合にTrueが返される|
|unique|インデックスオブジェクトから重複のない値の配列を計算する|

# 5.2  pandasの重要な機能

## 5.2.1  再インデックス付け

In [66]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [67]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

pandasのオブジェクトのメソッドにreindexがあり、新しいインデックスに従ったデータを持つ新しいオブジェクトを作成する  
インデックスに対する既存の値が存在しない場合、欠損値が代入される

In [68]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [69]:
obj3.reindex(range(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

時系列データのようなデータに順序がある場合は、再インデックス付けのときに内挿や穴埋めができると役に立つ  
そのためには、reindexメソッドのキーワード引数のmethodを使うことでできる  
例えばffillというメソッドを指定すると、値が前方に穴埋めされる

In [70]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index=["a", "c", "d"],
                    columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [71]:
frame2 = frame.reindex(["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [72]:
frame.reindex(columns=["Texas", "Utah", "California"])

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

データフレームではreindexメソッドを使って行インデックスや列インデックスを変更することができる  
シーケンスだけを渡した場合は、行が再インデックス付けされる  
キーワード引数のcolumnsを指定することで列の再インデックス付けをすることができる

reindexメソッドの引数

|引数|説明|
|:-|:-|
|index|インデックスに使用する新しいシーケンスを渡す。インデックスオブジェクトや、その他のPythonのシーケンス型データ構造を持つものでも指定可能。インデックスオブジェクトはコピーされずにそのまま使用される|
|method|内挿、穴埋めの方法の指定ができる。ffillは前方に穴埋めし、bfillは後方に穴埋めする|
|fill_value|再インデックス付けのときに、欠損値の代わりに使用する値を指定できる|
|limit|前方、後方穴埋めのときに、どれだけの要素数のギャップを埋めるかの最大値を指定できる|
|tolerance|前方、後方穴埋めのときに、インデックスの数値にどれくらいの差がある場合まで穴埋めを行うかの最大値を指定できる|
|level|階層型インデックスを使用している場合に、再インデックス付けを行う階層を指定できる|
|copy|Trueを指定すると、新インデックスが旧インデックスと同じである場合でも、常にデータがコピーされる。Falseを指定すると、インデックスが同じである場合にはデータがコピーされない|

## 5.2.2  軸から要素を削除する

In [73]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [74]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [75]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

特定の軸から1つかそれ以上の要素を削除するには、削除したい要素を指定するインデックスの配列やリストを用意する必要がある  
そして、dropメソッドを使い、削除したい軸のインデックスを渡すことで、新しいオブジェクトを作成する  
複数削除する場合は、dropメソッドに軸のインデックスをシーケンスにまとめて渡すこと削除できる

In [76]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=["Ohio", "Colorado", "Utah", "New York"],
                   columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [77]:
data.drop(["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

データフレームでは、インデックスの要素を行と列のどちらかを削除することができる  
dropメソッドにラベルのシーケンスを渡して呼び出すと、行から要素が削除される

In [78]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [79]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

データフレームから列を指定して削除するには、dropメソッドのキーワード引数のaxisに1か"columns"を渡すことで指定したインデックスの列を削除することができる

In [80]:
obj.drop("c", inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

dropのようなシリーズやデータフレームのサイズや内容を変更する多くの関数やメソッドは、キーワード引数のinplaceを持っていて、Trueを渡すことで新しいオブジェクトを返さずに直接変更することができる

## 5.2.3  インデックス参照、選択、フィルタリング

In [81]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [82]:
obj["b"]

1.0

In [83]:
obj[1]

1.0

In [84]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [85]:
obj[["a", "b", "c"]]

a    0.0
b    1.0
c    2.0
dtype: float64

In [86]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [87]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

シリーズのインデックス参照は、NumPyの配列と同じように使える  
ただし、シリーズでは整数値の指定だけでなく、シリーズのインデックス値を指定した参照もできる

In [88]:
obj["b":"c"]

b    1.0
c    2.0
dtype: float64

ラベルを使ったスライシングは通常のPythonのスライシングとは異なり、終点までが含まれる

In [89]:
obj["b":"c"] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

インデックスを参照して一部を指定したうえで代入を行うと、指定した要素の部分が変更される

In [90]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=["Ohio", "Colorado", "Utah", "New York"],
                   columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [92]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

データフレームに対してインデックス参照を行い、1つ以上の列を取り出して、それぞれの列が待つ値やシーケンスを取得するためには上のようにすればできる

In [93]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [94]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

データフレームのインデックス参照には特殊なケースがあり、スライシングや真偽値の配列を使って取得する行を選択するケースになる  
data[ : 2 ]のようにすれば行を選択することできるが、この記法は利便性のために提供されているもので、通常は[ ]演算子に1つの要素やリストを指定すると列が選択される  
他にも真偽値を持つデータフレームでのインデックス参照ができ、スカラー値とデータフレームを比較して、真偽値がTrueの要素になった軸のみを表示することができる

In [95]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [96]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

真偽値を持つデータフレームを使ってインデックス参照を行い、代入を行うことで、Trueの要素のみに代入を行うことができる  
これによってデータフレームを2次元のNumPy配列のように扱うことができる

### 5.2.3.1  locとilocによるデータの選択

In [97]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

データフレームオブジェクトのlocを使うことで、NumPyのように軸を指定してデータフレームから行や列の一部分を選択することができる  
ラベル名を渡して指定したいときにlocを使う

In [98]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [99]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [100]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

データフレームから一部分を選択したいときに、ラベル名ではなくインデックス位置を使いたいときはilocを使う

In [101]:
data.loc[:"Utah", "two"] # 行はUtahまで、列はtwoを選択

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [102]:
data.iloc[:, :3][data.three > 5] # 行をすべて、列は0～2　そしてthreeの値が5より大きい列を選択

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

locもilocもラベルを使った指定に加えて、スライシングも使うことができる

データフレームにおけるインデックス参照の方法

|方法|説明|
|:-|:-|
|df[val]|データフレームから列や列のシーケンスを取り出す方法。利便性の特殊なケースとして、行を抽出するための真偽値の配列、行のスライス、真偽値を持つデータフレームが使用可能になる|
|df.loc[val]|データフレームの1つ以上の行を、ラベルを指定して選択する|
|df.loc[:,val]|1つ以上の列を、ラベルを指定して選択する|
|df.loc[val1,val2]|行と列をラベルを指定して選択する|
|df.iloc[where]|データフレームの1つ以上の行を、整数のインデックス位置を指定して選択する|
|df.iloc[;,where]|1つ以上の列を、整数のインデックス位置を指定して選択する|
|df.iloc[where_i,where_j]|行と列を整数のインデックス位置を指定して選択する|
|df.at[label_i,label_j]|行とラベルを指定して、1つの値を取得する|
|df.iat[i,j]|行と列のインデックス位置を指定して、1つの値を取得する|
|reindexメソッド|行と列をラベルを指定して選択する|
|get_value, set_valueメソッド|行と列のラベルを指定して、1つの値を選択する|

## 5.2.4  整数のインデックス

In [103]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [104]:
ser[-1]

KeyError: -1

上のようにpandasのインデックス指定で-1を使って一番最後の要素を取り出そうとするとエラーが起きてしまう  
これは-1という数字の指定がラベルベースの-1なのかインデックス位置としての-1なのかが判断できないことが理由になる

In [105]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])
ser2[-1]

2.0

In [106]:
ser3 = pd.Series(np.arange(3.), index=[-2, -1, 0])
ser3[-1]

1.0

-1を使ってインデックスを指定をしてもエラーが起こらないようにするには、インデックスを指定してあげることで回避できる  
上のser2はインデックスに文字列を使っているために、自動的にインデックス位置としての-1だと解釈して一番最後の要素を返してくれる  
次のser3はインデックス位置内に-1が入っているため、自動的にラベルベースとしての-1だと解釈してインデックスが-1の要素を返してくれる

In [107]:
ser[-1:]

2    2.0
dtype: float64

In [108]:
ser[:1]

0    0.0
dtype: float64

In [109]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [110]:
ser.iloc[:1]

0    0.0
dtype: float64

-1を使ってインデックス位置を指定したければコロンを使うことでも回避できるが、  
正確に扱いたいのであれば、ラベルベースのインデックス参照のときはloc  
インデックス位置での参照のときはilocを使うと間違いない

## 5.2.5  算術とデータの整形

In [111]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c", "e", "f", "g"])

In [112]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [113]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [114]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

pandasは別々のインデックスを持つオブジェクト間で算術計算をした時の振る舞いが重要な機能になっている  
例えば別々のインデックスを持つシリーズオブジェクトを加算した場合、インデックスペアの和集合になる  
そして、重複していないインデックスでは欠損値が代入される

In [115]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"), 
                  index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"), 
                  index=["Utah", "Ohio", "Texas", "Oregon"])

In [116]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [117]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [118]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

データフレームで加算した場合でも行と列が和集合された結果が表示され、重複していない要素は欠損値が入る

### 5.2.5.1  算術演算メソッドと値の置換

In [119]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                  columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                  columns=list("abcde"))
df2.loc[1, "b"] = np.nan

In [120]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [121]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [122]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

前の節でも説明した通り、加算したときに重複しないラベルの要素はすべて欠損値になる  
これを解消して、片方にしか軸のラベルがない場合には0などの特別な値で置換してから足して欠損値を出さないようにしたい

In [123]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

このように、データフレームオブジェクトのaddメソッドを使って、キーワード引数のfill_valueに存在しないときに置換した値を渡すことで、上の問題が解消できる

In [124]:
df1 / 2

     a    b    c    d
0  0.0  0.5  1.0  1.5
1  2.0  2.5  3.0  3.5
2  4.0  4.5  5.0  5.5

In [125]:
2 / df1

      a         b         c         d
0   inf  2.000000  1.000000  0.666667
1  0.50  0.400000  0.333333  0.285714
2  0.25  0.222222  0.200000  0.181818

In [126]:
df1.div(2)

     a    b    c    d
0  0.0  0.5  1.0  1.5
1  2.0  2.5  3.0  3.5
2  4.0  4.5  5.0  5.5

In [127]:
df1.rdiv(2)

      a         b         c         d
0   inf  2.000000  1.000000  0.666667
1  0.50  0.400000  0.333333  0.285714
2  0.25  0.222222  0.200000  0.181818

シリーズやデータフレームの算術メソッドはaddやdivのようなものの他に、rで始まるraddやrdivメソッドも持っていて、オブジェクトと引数の関係が反転して計算してくれる

算術メソッド

|add, radd|加算を行うメソッド|
|sub, rsub|減算を行うメソッド|
|div, rdiv|除算を行うメソッド|
|floordiv, rfloordiv|除算を行い、小数点以下を切り捨てる|
|mul, rmul|乗算を行うメソッド|
|pow, rpow|累乗を行うメソッド|

In [128]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

reindexを使った再インデックス付けのときにも、fill_valueを使って置換する値を指定することができる

### 5.2.5.2  データフレームとシリーズでの演算

In [129]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [130]:
arr[0]

array([0., 1., 2., 3.])

In [131]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

上はNumPyでの演算で、行ごとに演算処理が行われる  
データフレームちシリーズでも同じようにできる

In [132]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                    columns=list("bde"),
                    index=["Utah", "Ohio", "Texas", "Oregon"])
series = frame.iloc[0]

In [133]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [134]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [135]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

デフォルトでは、データフレームとシリーズ同士の算術演算では、シリーズのインデックスとデータフレームの列がマッチングされ、行ごとに演算が行われる

In [136]:
series2 = pd.Series(range(3), index=["b", "e", "f"])

In [137]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

インデックスの値が片方しかなかった場合は、インデックスを和集合したものが入り、欠損値が入る

In [138]:
series3 = frame["d"]

In [139]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [140]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

インデックスを行にマッチングさせて列方向で演算を行いたい場合は、算術メソッドを使ってキーワード引数のaxisにindexもしくは0を渡すことでできる

## 5.2.6  関数の適用とマッピング

In [141]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list("bde"),
                    index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah   -0.611888  0.996829  0.776897
Ohio    0.782359 -1.484586  0.924702
Texas  -1.060440 -0.218652 -0.839570
Oregon -1.960284 -0.128927  0.727773

In [142]:
np.abs(frame)

               b         d         e
Utah    0.611888  0.996829  0.776897
Ohio    0.782359  1.484586  0.924702
Texas   1.060440  0.218652  0.839570
Oregon  1.960284  0.128927  0.727773

NumPyのufunc(配列の要素に適用可能なメソッド群)は、pandasのオブジェクトでも機能する

In [143]:
frame.apply(lambda x: x.max() - x.min())

b    2.742643
d    2.481415
e    1.764272
dtype: float64

また、1次元配列に適用可能な関数を行や列に対して適用するというものがあり、データフレームのapplyメソッドに関数を渡すことでできる  
applyの中の関数がデータフレームの各列に対して一度だけ呼ばれ、列をインデックスとして持ったシリーズになる

In [144]:
frame.apply(lambda x: x.max() - x.min(), axis="columns")

Utah      1.608717
Ohio      2.409288
Texas     0.841788
Oregon    2.688057
dtype: float64

applyのキーワード引数axisにcolumnsを渡すことで各行に対して適用することができる  
多くの一般的な配列に対する集計処理(sumやmeanなど)は、データフレームのメソッドとして使うことができるので、applyを使う必要はない

In [145]:
def f(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

In [146]:
frame.apply(f)

            b         d         e
min -1.960284 -1.484586 -0.839570
max  0.782359  0.996829  0.924702

applyに渡す関数は、スカラー値にして戻す必要はなく、複数の値を持ったSeriesやDataFrameを戻すこともできる

In [147]:
frame.applymap(lambda x: f"{x:.2f}")

            b      d      e
Utah    -0.61   1.00   0.78
Ohio     0.78  -1.48   0.92
Texas   -1.06  -0.22  -0.84
Oregon  -1.96  -0.13   0.73

データフレームの列や行ごとではなく、各要素ごとに関数を適用させたいならapplymapメソッドを使って関数を渡すことでできる

In [148]:
frame["e"].map(lambda x: f"{x:.2f}")

Utah       0.78
Ohio       0.92
Texas     -0.84
Oregon     0.73
Name: e, dtype: object

applymapとmapという名前が入っているのは、シリーズで要素ごとに関数を適用するためのmapメソッドがあるからになる

## 5.2.7  ソートとランク

In [149]:
obj = pd.Series(range(4), index=["d", "a", "b", "c"])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [150]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

データを一定の基準でソートする機能もpandasには組み込まれていて、行や列のインデックスを辞書順でソートするにはsort_indexメソッドを使うことでできる

In [151]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), 
                    index=["three", "one"],
                    columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [152]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [153]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

データフレームでは、sort_indexをデフォルトで使うと行をソートし、axis=1を渡すと列をソートする

In [154]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

sort_indexはデフォルトでは昇順でソートされるが、キーワード引数のascendingにFalseを渡すことで降順にできる

In [155]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [156]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

シリーズで値によってソートをしたいときは、sort_valuesメソッドを使うことでできる

In [157]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [158]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

デフォルトでsort_valuesを使うと欠損値は末尾にソートされる

In [159]:
frame = pd.DataFrame({"b": [4, 7,-3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [160]:
frame.sort_values(by="b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

データフレームをソートするときは、1つ以上の列をソートキー(ソートをする基準の列)に指定することができる  
そのためには、sort_valuesでキーワード引数のbyに1つ以上の列名を渡すことでできる

In [161]:
frame.sort_values(by=["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

複数の列をソートキーに指定してソートするには、sort_valuesのbyキーワード引数に列の名前のリストを渡すことでできる

In [162]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [163]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

データフレームやシリーズはランク(その要素の順位)を付けることができる  
ランクを付けるには、rankメソッドを使うことでできる  
デフォルトでは、タイ(同位)になったグループは、各グループの平均値が入れられる  
上の場合7と4がタイで、7は6番目と7番目だから平均値の6.5、4は4番目と5番目だから平均値の4.5になる

In [164]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

ランク付けでタイになったときに、平均値ではなく上から観測された順番にランクを付けたい場合は、キーワード引数のmethodに文字列のfirstを入れることでできる

In [165]:
obj.rank(ascending=False, method="first")

0    1.0
1    7.0
2    2.0
3    3.0
4    5.0
5    6.0
6    4.0
dtype: float64

ランク付けを降順にするには、rankメソッドのキーワード引数のascendingにFalseを渡すことでできる

In [166]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1], "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [167]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [168]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

データフレームでrankメソッドを使うと、デフォルトでは列ごとにランクを付け、axisをcolumnsに設定すると行ごとにランク付けを行う

ランクがタイになったときのランク代入ルール一覧

|メソッド(methodに渡す文字列)|説明|
|"average"|デフォルトのルール。タイになったグループの各要素にランクの平均値を代入する|
|"min"|タイになったグループ全体の最小ランクを各要素に代入する|
|"max"|タイになったグループ全体の最大ランクを各要素に代入する|
|"first"|データが出現した順番に従ってランクを代入する|
|"dense"|"min"のときと同じで最小ランクを各要素に代入するが、次のランクが1だけ増えたものになる(minだと要素の数だけ増えたものになる)|

## 5.2.8  重複したラベルを持つ軸のインデックス

今までの例では、すべてのインデックスは一意なラベル(インデックス値)を持っていた  
reindexのように、pandasの多くの関数ではインデックスのラベルが位置である必要があるが、インデックスのラベル自体は一意であっても問題ない  
以下では重複したインデックスを持つシリーズを見ていく

In [169]:
obj = pd.Series(range(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [170]:
obj.index.is_unique

False

インデックスオブジェクトにis_unique属性を使うことで、インデックスのラベルが一意であるかどうかを確認することができる

In [171]:
obj["a"]

a    0
a    1
dtype: int64

In [172]:
obj["c"]

4

重複したインデックスを選択したときと、重複していないインデックスを選択したときでは振る舞いが変わり、  
重複したインデックスを選択したときは、シリーズが返されるが、重複していないインデックスを選択したときはスカラー値が返される

In [173]:
frame = pd.DataFrame(np.random.randn(4, 3), index=["a", "b", "b", "c"])
frame

          0         1         2
a -0.586654 -2.641342 -0.247178
b -0.087225  1.021540  0.934418
b -1.336374 -0.757690 -0.561081
c  0.003936  0.343586  0.834454

In [174]:
frame.loc["a"]

0   -0.586654
1   -2.641342
2   -0.247178
Name: a, dtype: float64

In [175]:
frame.loc["b"]

          0        1         2
b -0.087225  1.02154  0.934418
b -1.336374 -0.75769 -0.561081

一意なラベルではないデータフレームやシリーズを使って選択を行うことで、ラベルの重複の有無によってデータの型が変わってしまう可能性がある  
そのため、できるだけ一意なラベルを使わない方がよい

# 5.3  要約統計量の集計と計算

pandasオブジェクトでは、一般的な数学、統計的なメソッドが使える  
これらのほとんどのメソッドは、集約や要約統計量に分類されるようなものになる  
これらのメソッドでは、データフレームの行や列にあるシリーズから合計値や平均値などの1つの値を計算する  
NumPyの配列と違い、これらのメソッドは欠損値を扱う機能が組み込まれている

In [176]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [177]:
df.sum()

one    9.25
two   -5.80
dtype: float64

データフレームのsumメソッドは、列ごとに合計値を計算したシリーズにして返してくれる  
欠損値は除外して計算する

In [178]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

データフレームの行ごとに合計値を求めたい場合は、axisに1を渡すことでできる

In [179]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [180]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

欠損値も含めて計算をしたい場合は、メソッドのキーワード引数skipnaをFalseにすることでできる

集約メソッドのオプション

|オプション|説明|
|:-|:-|
|axis|集約する方向軸。0がデータフレームの行方向で、1が列方向になる|
|skipna|欠損値を除外するかどうか。デフォルトはTrue|
|level|軸が階層的にインデックス付けされている(MultiIndexが使われている)場合に、集約対象のグループの階層を指定する|

In [181]:
df.idxmax()

one    b
two    d
dtype: object

In [182]:
df.idxmin()

one    d
two    b
dtype: object

idxmaxやidxminといったメソッドもあり、これらは最大や最小の値を持つインデックス値をシリーズにして返してくれる

In [183]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

cumsumなどのcum～で始まる累積を計算するメソッドもある

In [184]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

集約でも累積でもないものとしてdescribeメソッドがあり、複数の要約統計量をまとめて返してくれる

In [185]:
obj = pd.Series(["a", "a", "b", "c"] * 4)

In [186]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

数値データではないシリーズやデータフレームの場合、別の要約統計量を返してくれる

要約統計量の一覧

|メソッド|説明|
|:-|:-|
|count|欠損値ではない要素の数|
|describe|シリーズやデータフレームの列に対して、複数の要約統計量を求める|
|min, max|最小値、最大値を求める|
|argmin, argmax|最小値、最大値が得られた要素のラベルを求める|
|idxmin, idxmax|最小値、最大値が得られた要素のインデックス値を求める|
|quantile|データのパーセント点を0から1の範囲で求める|
|sum|合計値|
|mean|平均値|
|median|中央値|
|mad|平均値からの平均絶対偏差|
|prod|全ての値の積|
|var|標本分散|
|std|標本標準偏差|
|skew|標本歪度(3次のモーメント)|
|kurt|標本尖度(4次のモーメント)|
|cumsum|累積合計値|
|cummin, cummax|累積の最小値と最大値|
|cumprod|累積の積|
|diff|1次の階差を求める(時系列データで便利)|
|pct_change|パーセントの変化を求める|

## 5.3.1  相関と共分散

相関や共分散などの統計量は変数のペアから求めることができる  
以下ではpandas-datareaderパッケージを使ってYahoo!Financeから取得した株価と出来高のデータフレームについて考えてみる

In [187]:
import pandas_datareader.data as web

In [188]:
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ["AAPL", "IBM", "MSFT", "GOOG"]}

In [189]:
price = pd.DataFrame({ticker: data["Adj Close"] for ticker, data in all_data.items()})

In [190]:
volume = pd.DataFrame({ticker: data["Volume"] for ticker, data in all_data.items()})

In [191]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2015-09-29   25.195972  114.090080   39.478069   594.969971
2015-09-30   25.482449  116.092072   40.223278   608.419983
2015-10-01   25.316107  114.986984   40.541351   611.289978
2015-10-02   25.500929  115.779770   41.413811   626.909973
2015-10-05   25.593342  119.351326   42.377129   641.469971
...                ...         ...         ...          ...
2020-09-22  111.809998  120.510002  207.419998  1465.459961
2020-09-23  107.120003  118.830002  200.589996  1415.209961
2020-09-24  108.220001  118.089996  203.190002  1428.290039
2020-09-25  112.279999  118.949997  207.820007  1444.959961
2020-09-28  113.920097  121.011002  211.710007  1467.954956

[1259 rows x 4 columns]

In [192]:
volume

                   AAPL        IBM        MSFT     GOOG
Date
2015-09-29  293461600.0  4763500.0  32763600.0  2309500
2015-09-30  265892000.0  3946200.0  34958900.0  2413400
2015-10-01  255716400.0  3880900.0  28657900.0  1867600
2015-10-02  232079200.0  3054400.0  41839000.0  2684800
2015-10-05  208258800.0  5131800.0  34369300.0  1803600
...                 ...        ...         ...      ...
2020-09-22  183055400.0  2957800.0  33517100.0  1583200
2020-09-23  150718700.0  3939400.0  30803800.0  1657400
2020-09-24  167743300.0  3546200.0  31202500.0  1450200
2020-09-25  149736300.0  2952900.0  29416000.0  1323000
2020-09-28    9367000.0   130804.0   1994113.0    88663

[1259 rows x 4 columns]

特定の株式相場情報サービスからデータをダウンロードするために、pandas_datareaderモジュールを使っている

In [193]:
returns = price.pct_change()

In [194]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-09-22  0.015716  0.002162  0.024094  0.023967
2020-09-23 -0.041946 -0.013941 -0.032928 -0.034290
2020-09-24  0.010269 -0.006227  0.012962  0.009243
2020-09-25  0.037516  0.007283  0.022787  0.011671
2020-09-28  0.014607  0.017327  0.018718  0.015914

まずは株価のパーセント変化を求めるためにpct_changgeメソッドを使って、tailメソッドで下の5行を表示している

In [195]:
returns["MSFT"].corr(returns["IBM"])

0.5750405045332108

In [196]:
returns["MSFT"].cov(returns["IBM"])

0.0001615568146514051

シリーズのcorrメソッドは渡したシリーズとの欠損値でない値の重なりから相関を求める  
同様にシリーズのcovメソッドは渡したシリーズとの共分散を求める

In [197]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.496491  0.706398  0.655276
IBM   0.496491  1.000000  0.575041  0.535542
MSFT  0.706398  0.575041  1.000000  0.783991
GOOG  0.655276  0.535542  0.783991  1.000000

In [198]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000350  0.000149  0.000232  0.000203
IBM   0.000149  0.000257  0.000162  0.000142
MSFT  0.000232  0.000162  0.000307  0.000227
GOOG  0.000203  0.000142  0.000227  0.000273

データフレームでのcorrメソッドやcovメソッドでは、完全な相関と共分散をデータフレーム形式で返してくれる

In [199]:
returns.corrwith(returns.IBM)

AAPL    0.496491
IBM     1.000000
MSFT    0.575041
GOOG    0.535542
dtype: float64

データフレームのcorrwithメソッドにシリーズを渡すと、データフレームの各列に対するシリーズの相関を求めることができる

In [200]:
returns.corrwith(volume)

AAPL   -0.079294
IBM    -0.099628
MSFT   -0.055577
GOOG   -0.150848
dtype: float64

corrwithメソッドにデータフレームを渡した場合は、一致した列名同士で相関が計算される  
上ではパーセント変化と、出来高の相関を求めている  
axisに1を渡すことで各行ごとに求めることもできる

## 5.3.2  一意な値、頻度の確認、所属の確認

他の関連するメソッドには、1次元のシリーズに含まれる値の情報を抽出するものがある

In [201]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [202]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

シリーズのuniqueメソッドは、シリーズの中の一意な値を配列として取り出して返す  
ソートをして返さないので、必要な場合はsortメソッド使うとよい

In [203]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

シリーズのvalue_countsメソッドは、シリーズに含まれる値の頻度を求めてシリーズにして返す  
value_countsメソッドは、便宜上、値の頻度を降順でソートして返す

In [204]:
pd.value_counts(obj.values, sort=False)

c    3
d    1
a    3
b    2
dtype: int64

pandasの関数としてvalue_countsを使うこともでき、sortにFalseを渡すことでソートせずに最初に頻出した順番にすることもできる

In [205]:
mask = obj.isin(["b", "c"])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

シリーズのisinメソッドは、ベクトル形式の集合を指定して、その値のいずれかが含まれているかを確認できる  
データ集合をフィルタリングして、部分集合するときに非常に便利になる

In [206]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])

In [207]:
unique_vals = pd.Series(["c", "b", "a"])

In [208]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

isinに関連するものとしてIndexオブジェクトのget_indexerメソッドがある  
これは、一意でない値を持つかもしれない配列を、一意な値の配列にするためのインデックス配列を生成する

一意な値、頻度の確認、所属の確認するメソッド

|メソッド|説明|
|:-|:-|
|isin|各シリーズの値が、引数で渡されたシーケンスの値に含まれるかどうかを示す真偽値の配列を求める|
|get_indexer|ある配列を、一意な値を持つ別の配列にするために、各値のインデックス位置を求める。データを整理するときや結合するときに役立つ|
|unique|シリーズの値のうち、一意な値の集合を観測された順に取り出す|
|value_counts|シリーズに含まれる一意な値をインデックスとして、そのインデックスに対応する値の頻度を求める。頻度の降順に並ぶ|

In [209]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                    "Qu2": [2, 3, 1, 2, 3],
                    "Qu3": [1, 5, 2, 4, 4]}) 
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [210]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

pandasのvalue_counts関数をデータフレームのapplyメソッドを使って適用すると、  
行ラベルの値が、その列に何回出現したかを求めたデータフレームにして返してくれる  
行ラベルの値が1度も出現しなかった場合は欠損値が入るので、fillnaメソッドに0を渡して0を代入するようにしている